{
  "products": [
    {
      "id": "4",
      "name": "Wooden TV Stand",
      "category": "livingroom",
      "image": "https://img.freepik.com/free-photo/mock-up-frame-cabinet_23-2148894142.jpg?t=st=1719939863~exp=1719943463~hmac=2172508fc073126ed58fdb24fef15035075f0c3eb3c7e5f635c3b7e18dec5059&w=740",
      "new_price": 700,
      "old_price": 900,
      "description": "A sturdy wooden TV stand with ample storage space.",
      "rating": 4.4,
      "reviews": 27,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        1,
        2,
        3
      ],
      "tags": [
        "wooden",
        "TV stand",
        "storage"
      ],
      "details": {
        "detailOne": "This wooden TV stand is crafted from durable hardwood, providing a sturdy base for your television. It features multiple shelves and compartments for organizing media devices, gaming consoles, and more. The natural wood finish adds a touch of warmth to any living room.",
        "detailTwo": "The TV stand's spacious design accommodates large TVs and offers plenty of storage space without sacrificing style. It's easy to assemble and maintain, making it a practical choice for any home entertainment setup."
      }
    },
    {
      "id": "5",
      "name": "Velvet Upholstered Armchair",
      "category": "livingroom",
      "image": "https://img.freepik.com/free-photo/pillow-sofa_74190-3667.jpg?t=st=1719939926~exp=1719943526~hmac=eee287c5f9d48c31a3ea45da731b83b04868d6315433e45bc41ab54d81e5444f&w=740",
      "new_price": 800,
      "old_price": 1000,
      "description": "A luxurious velvet upholstered armchair for cozy relaxation.",
      "rating": 4.6,
      "reviews": 32,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        6,
        7,
        8
      ],
      "tags": [
        "velvet",
        "armchair",
        "cozy"
      ],
      "details": {
        "detailOne": "Indulge in luxurious comfort with this velvet upholstered armchair. Its plush cushioning and ergonomic design provide excellent support for long hours of relaxation. The velvet fabric adds a touch of elegance to any room, making it a perfect addition to your living space.",
        "detailTwo": "The armchair's sturdy frame and high-quality upholstery ensure durability and easy maintenance. It's available in a variety of colors to suit different decor styles. Whether placed in a cozy corner or as part of a seating arrangement, this armchair enhances the ambiance of any room."
      }
    },
    {
      "id": "6",
      "name": "Contemporary Dining Table",
      "category": "dining",
      "image": "https://img.freepik.com/free-photo/delicious-indian-dosa-assortment_23-2149086041.jpg?t=st=1719940027~exp=1719943627~hmac=8856fa668f79f29e267c5815d53afd4a88d809c9a03eee16614562b6b7028651&w=740",
      "new_price": 1200,
      "old_price": 1500,
      "description": "A contemporary dining table that combines style and functionality.",
      "rating": 4.7,
      "reviews": 25,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        7,
        8,
        9
      ],
      "tags": [
        "contemporary",
        "dining table",
        "style"
      ],
      "details": {
        "detailOne": "This dining table features a sleek, minimalist design that complements modern interiors. Its sturdy construction ensures durability, while the spacious tabletop provides ample room for family meals or gatherings with friends. The neutral color scheme makes it easy to coordinate with various dining chairs and decor.",
        "detailTwo": "Crafted from high-quality materials, the table's smooth surface is easy to clean and maintain. It's ideal for everyday use and can be dressed up for special occasions with decorative tableware and centerpieces. Upgrade your dining area with this stylish and functional piece."
      }
    },
    {
      "id": "7",
      "name": "Fabric Upholstered Dining Chair",
      "category": "dining",
      "image": "https://img.freepik.com/free-photo/white-chair-with-table-with-flowers-living-room_181624-36664.jpg?t=st=1719940077~exp=1719943677~hmac=253a5073b6acd3087e7b232b468b6404aa0a8b2ec1563a63915637531e245449&w=740",
      "new_price": 250,
      "old_price": 300,
      "description": "A comfortable fabric upholstered dining chair for enjoyable meals.",
      "rating": 4.4,
      "reviews": 18,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        6,
        8,
        9
      ],
      "tags": [
        "fabric",
        "upholstered",
        "dining chair"
      ],
      "details": {
        "detailOne": "Enhance your dining experience with this comfortable upholstered dining chair. It features a padded seat and backrest upholstered in durable fabric, providing optimal comfort and support. The sturdy wooden legs ensure stability and longevity, making it a practical choice for everyday use.",
        "detailTwo": "The chair's ergonomic design promotes proper posture during meals, reducing discomfort and fatigue. Available in a variety of colors and patterns, it allows you to customize your dining space to suit your personal style. Whether used as a standalone piece or as part of a dining set, this chair adds charm and functionality to any dining room."
      }
    },
    {
      "id": "8",
      "name": "Extendable Wood Dining Table",
      "category": "dining",
      "image": "https://img.freepik.com/free-photo/view-table-arrangement-by-wedding-planner_23-2150167202.jpg?t=st=1719940117~exp=1719943717~hmac=93a65f882f68dbea8c6b74c78d87c4d5671829b17e24576a5ef25b01103104d9&w=740",
      "new_price": 1600,
      "old_price": 2000,
      "description": "An extendable wood dining table that adapts to your dining needs.",
      "rating": 4.6,
      "reviews": 22,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        6,
        7,
        9
      ],
      "tags": [
        "extendable",
        "wood",
        "dining table"
      ],
      "details": {
        "detailOne": "This versatile dining table features an extendable design, allowing you to accommodate extra guests or create more space for serving food. Crafted from solid wood, it offers durability and a classic look that complements any dining room decor.",
        "detailTwo": "The table's smooth finish is easy to maintain, ensuring long-lasting beauty and functionality. Whether used for everyday meals or special occasions, its adjustable size makes it a practical choice for modern living. Invest in this timeless piece to elevate your dining area."
      }
    },
    {
      "id": "9",
      "name": "Modern Glass Dining Set",
      "category": "dining",
      "image": "https://img.freepik.com/free-photo/high-angle-safari-party-with-drinks-arrangement_23-2149707887.jpg?t=st=1719940146~exp=1719943746~hmac=55c3f5af3b19da1082e305fc6568ce97f0dde6ea81118660ddbd48147f6e3499&w=740",
      "new_price": 1800,
      "old_price": 2200,
      "description": "A modern glass dining set for contemporary dining spaces.",
      "rating": 4.5,
      "reviews": 20,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        6,
        7,
        8
      ],
      "tags": [
        "modern",
        "glass",
        "dining set"
      ],
      "details": {
        "detailOne": "Upgrade your dining area with this sleek and stylish glass dining set. The table features a tempered glass tabletop supported by sturdy metal legs, offering both durability and modern appeal. The chairs are upholstered in high-quality fabric for added comfort and sophistication.",
        "detailTwo": "Perfect for contemporary interiors, the set's minimalist design enhances the visual appeal of your dining space. Whether used for casual meals or formal gatherings, it provides a chic backdrop for memorable dining experiences. Elevate your home decor with this versatile dining set."
      }
    },
    {
      "id": "10",
      "name": "Classic Wooden Coffee Table",
      "category": "livingroom",
      "image": "https://img.freepik.com/free-photo/room-decor-with-potted-plants-candles-wooden-table_23-2149427996.jpg?t=st=1719940180~exp=1719943780~hmac=98dbfb0d7b0e84b8344aa8f24824128c3a058e92cd77eedf02e58237c2017599&w=740",
      "new_price": 500,
      "old_price": 700,
      "description": "A classic wooden coffee table for a timeless look.",
      "rating": 4.4,
      "reviews": 25,
      "topTrends": false,
      "newCollections": false,
      "relatedProducts": [
        1,
        2,
        3
      ],
      "tags": [
        "classic",
        "wooden",
        "coffee table"
      ],
      "details": {
        "detailOne": "Enhance your living room with this classic wooden coffee table. Crafted from solid wood, it features a timeless design that blends seamlessly with traditional and transitional decor styles. The sturdy construction ensures durability and longevity, making it a lasting addition to your home.",
        "detailTwo": "The coffee table's spacious surface provides ample room for beverages, books, and decorative accents. It's ideal for creating a focal point in your living space while offering practical functionality. Upgrade your interior with this versatile piece that exudes charm and elegance."
      }
    },
    {
      "id": "11",
      "name": "Leather Sectional Sofa",
      "category": "livingroom",
      "image": "https://img.freepik.com/free-photo/close-up-sofa-with-three-cushions_1203-527.jpg?t=st=1719939902~exp=1719943502~hmac=dbbe7dea6408edf253257d479bbe548eb9a659f24676bab0b8d0b7557ad98f0f&w=740",
      "new_price": 2200,
      "old_price": 2600,
      "description": "A luxurious leather sectional sofa for spacious seating.",
      "rating": 4.8,
      "reviews": 30,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        12,
        13,
        14
      ],
      "tags": [
        "leather",
        "sectional sofa",
        "luxury"
      ],
      "details": {
        "detailOne": "Transform your living room with this luxurious leather sectional sofa. Its L-shaped design offers ample seating space, perfect for hosting guests or lounging with family. The premium leather upholstery adds sophistication to your decor while providing exceptional comfort.",
        "detailTwo": "The sofa features adjustable headrests and armrests for personalized comfort, ensuring optimal relaxation. Its sturdy frame and high-density foam cushions offer durability and support for years to come. Elevate your home with this statement piece that combines style and functionality."
      }
    },
    {
      "id": "12",
      "name": "Mid-Century Modern Armchair",
      "category": "livingroom",
      "image": "https://img.freepik.com/free-photo/realistic-interior-design-with-furniture_23-2151439801.jpg?t=st=1719940247~exp=1719943847~hmac=600f82ed58c0a29d6d7aaa47c294442739283bb43e557aadd66f9c98ec20cdf7&w=740",
      "new_price": 900,
      "old_price": 1100,
      "description": "A mid-century modern armchair with retro charm.",
      "rating": 4.5,
      "reviews": 28,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        11,
        13,
        14
      ],
      "tags": [
        "mid-century",
        "modern",
        "armchair"
      ],
      "details": {
        "detailOne": "Add a touch of retro charm to your living space with this mid-century modern armchair. Its sleek silhouette and tapered legs capture the essence of mid-century design, making it a stylish addition to any room. The upholstered seat and backrest offer comfort and support for relaxation.",
        "detailTwo": "Crafted from high-quality materials, the armchair's solid wood frame ensures durability and stability. Available in various upholstery options, it allows you to customize the chair to suit your decor preferences. Whether used as a standalone piece or paired with a sofa, this armchair enhances the aesthetic appeal of your home."
      }
    },
    {
      "id": "13",
      "name": "Marble Top Coffee Table",
      "category": "livingroom",
      "image": "https://img.freepik.com/free-photo/morning-cup-coffee-white-table_23-2148251658.jpg?t=st=1719940286~exp=1719943886~hmac=49e3d2a5f78082bf2f655f06b50fd13e36492abc188b131108916f719cf8bbfe&w=740",
      "new_price": 950,
      "old_price": 1200,
      "description": "A sophisticated marble top coffee table for elegant living rooms.",
      "rating": 4.6,
      "reviews": 24,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        11,
        12,
        14
      ],
      "tags": [
        "marble",
        "coffee table",
        "sophisticated"
      ],
      "details": {
        "detailOne": "Enhance your living room with this sophisticated marble top coffee table. The genuine marble surface exudes elegance and luxury, creating a focal point in your decor. Its sturdy base ensures stability while adding a contemporary touch to your interior.",
        "detailTwo": "The coffee table's spacious design provides ample room for decorative accents, books, and beverages. It's easy to maintain and clean, making it a practical choice for everyday use. Elevate your home with this timeless piece that combines style with functionality."
      }
    },
    {
      "id": "14",
      "name": "Industrial Style Bookcase",
      "category": "livingroom",
      "image": "https://img.freepik.com/free-photo/full-shot-modern-girl-retro-style_23-2150595561.jpg?t=st=1719940322~exp=1719943922~hmac=27a25cf99f3c660318441d247ea95e4ca7c7a2e8e31e1d510d800b00df6ffb92&w=740",
      "new_price": 600,
      "old_price": 800,
      "description": "An industrial style bookcase with rustic charm.",
      "rating": 4.3,
      "reviews": 21,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        11,
        12,
        13
      ],
      "tags": [
        "industrial",
        "bookcase",
        "rustic"
      ],
      "details": {
        "detailOne": "Bring rustic charm to your living space with this industrial style bookcase. Its open shelves and metal frame showcase a blend of modern and vintage aesthetics, making it a versatile piece for storing books, decor, and personal items.",
        "detailTwo": "Crafted from durable materials, the bookcase offers stability and longevity. Its compact design fits well in various spaces, from living rooms to home offices. Whether used as a standalone unit or paired with other furniture, it adds character and organization to your interior."
      }
    },
    {
      "id": "15",
      "name": "Velvet Upholstered Bed",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/interior-decoration-inspired-by-mexican-folklore_23-2150711333.jpg?t=st=1719940370~exp=1719943970~hmac=bd42ccb66321f71bccd583ed2ec28d9da22bab7c15f0966da2788819590ad328&w=740",
      "new_price": 1800,
      "old_price": 2200,
      "description": "A luxurious velvet upholstered bed for elegant bedrooms.",
      "rating": 4.7,
      "reviews": 29,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        16,
        17,
        18
      ],
      "tags": [
        "velvet",
        "upholstered bed",
        "luxury"
      ],
      "details": {
        "detailOne": "Transform your bedroom into a sanctuary of luxury with this velvet upholstered bed. Its plush headboard and footboard create a focal point, while the sturdy frame provides stability and support. The velvet fabric adds a touch of opulence to your sleeping space.",
        "detailTwo": "The bed's ergonomic design promotes comfort and relaxation, ensuring restful nights. Available in various sizes and colors, it allows you to customize your bedroom decor. Upgrade your sleep experience with this elegant bed that combines style with comfort."
      }
    },
    {
      "id": "16",
      "name": "Modern Wooden Dresser",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/beautiful-shot-modern-wooden-furniture-isolated-white_181624-22671.jpg?t=st=1719940406~exp=1719944006~hmac=733731b648cf27745745174a0c7caa5fd080f1204ba374e7ae859851c30360ad&w=740",
      "new_price": 950,
      "old_price": 1200,
      "description": "A modern wooden dresser with ample storage.",
      "rating": 4.5,
      "reviews": 26,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        15,
        17,
        18
      ],
      "tags": [
        "modern",
        "wooden",
        "dresser"
      ],
      "details": {
        "detailOne": "Organize your bedroom with this modern wooden dresser. It features multiple drawers and compartments for storing clothing, accessories, and personal items. The sleek design and clean lines add a contemporary touch to your bedroom decor.",
        "detailTwo": "Crafted from durable wood materials, the dresser offers long-lasting performance and functionality. Its spacious top surface provides additional space for decorative accents or a vanity mirror. Whether used in a master bedroom or guest room, this dresser enhances both style and storage."
      }
    },
    {
      "id": "17",
      "name": "Upholstered Storage Bench",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/still-life-shoe-rack-indoors_23-2150960714.jpg?t=st=1719940454~exp=1719944054~hmac=bb8c4d1702e93ec61c72d030117d24df94930522f2e5c578a7946bd29d23c62d&w=740",
      "new_price": 350,
      "old_price": 450,
      "description": "An upholstered storage bench for practical and stylish seating.",
      "rating": 4.3,
      "reviews": 22,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        15,
        16,
        18
      ],
      "tags": [
        "upholstered",
        "storage bench",
        "seating"
      ],
      "details": {
        "detailOne": "Add versatility to your bedroom with this upholstered storage bench. It features a cushioned seat upholstered in fabric for comfort and style. The storage compartment beneath the seat offers ample space for blankets, pillows, or other essentials.",
        "detailTwo": "The bench's sturdy wooden legs ensure stability and durability, making it suitable for everyday use. Place it at the foot of your bed for additional seating and storage, or use it in an entryway for a convenient spot to put on shoes. Upgrade your home with this functional and elegant piece."
      }
    },
    {
      "id": "18",
      "name": "Vintage Bedside Table",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/luxury-retro-broadcast-radio-receiver_23-2148695304.jpg?t=st=1719940490~exp=1719944090~hmac=646bb3f19fb4eb53e95a01225497d8195de6d94c874be4f44bea889b5cf811a1&w=740",
      "new_price": 250,
      "old_price": 300,
      "description": "A vintage bedside table with timeless appeal.",
      "rating": 4.4,
      "reviews": 20,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        15,
        16,
        17
      ],
      "tags": [
        "vintage",
        "bedside table",
        "timeless"
      ],
      "details": {
        "detailOne": "Enhance your bedroom decor with this vintage bedside table. Its compact size fits perfectly next to a bed, providing convenient storage and display space. The classic design and rustic finish add charm and character to your sleeping space.",
        "detailTwo": "Crafted from solid wood, the bedside table offers durability and longevity. It features a drawer for storing nighttime essentials and an open shelf for books or decorative items. Whether used in a traditional or eclectic bedroom, this table adds functionality and style."
      }
    },
    {
      "id": "19",
      "name": "Chic Upholstered Headboard",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/ornate-bed-art-nouveau-style_23-2150975499.jpg?t=st=1719940524~exp=1719944124~hmac=d39e458dded7a31fbbfd11edeb27761c270f383666c19ec3480b9cc9ec74b997&w=740",
      "new_price": 400,
      "old_price": 500,
      "description": "A chic upholstered headboard for stylish bedroom decor.",
      "rating": 4.2,
      "reviews": 18,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        20,
        21,
        22
      ],
      "tags": [
        "chic",
        "upholstered headboard",
        "stylish"
      ],
      "details": {
        "detailOne": "Transform your bedroom with this chic upholstered headboard. Its padded design offers comfort and support while adding a touch of elegance to your bed. The upholstered fabric is soft to the touch and available in various colors to suit your decor.",
        "detailTwo": "The headboard's sturdy construction ensures durability and longevity. It's easy to install and compatible with standard bed frames, making it a hassle-free addition to your bedroom. Upgrade your sleeping space with this stylish piece that combines comfort with contemporary flair."
      }
    },
    {
      "id": "20",
      "name": "Sleek Platform Bed",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/room-interior-hotel-bedroom_23-2150683465.jpg?t=st=1719940551~exp=1719944151~hmac=6d9b3c1d8909bff4ed923ca0c1744d1f3702f9ca786dbe63452f9e9f761fb96b&w=740",
      "new_price": 1200,
      "old_price": 1500,
      "description": "A sleek platform bed for modern bedroom settings.",
      "rating": 4.6,
      "reviews": 26,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        19,
        21,
        22
      ],
      "tags": [
        "sleek",
        "platform bed",
        "modern"
      ],
      "details": {
        "detailOne": "Update your bedroom with this sleek platform bed. Its low-profile design and minimalist aesthetics create a contemporary focal point in any bedroom. The sturdy frame provides reliable support for a restful night's sleep.",
        "detailTwo": "Crafted from high-quality materials, the bed's construction ensures durability and stability. It's available in various sizes to accommodate different mattress types. Whether used in a master bedroom or guest room, this platform bed enhances both style and comfort."
      }
    },
    {
      "id": "21",
      "name": "Rustic Wooden Wardrobe",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/retro-furniture-being-sold-yard-sale_23-2151216812.jpg?t=st=1719940582~exp=1719944182~hmac=533778254dee09a3712ce5f11b3d4018dfe037bb84c993288e2a5cdf38944fe3&w=740",
      "new_price": 1500,
      "old_price": 1800,
      "description": "A rustic wooden wardrobe with ample storage space.",
      "rating": 4.4,
      "reviews": 24,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        19,
        20,
        22
      ],
      "tags": [
        "rustic",
        "wooden",
        "wardrobe"
      ],
      "details": {
        "detailOne": "Organize your clothing and accessories with this rustic wooden wardrobe. Its spacious interior features hanging rods, shelves, and drawers for efficient storage. The distressed wood finish adds character and charm to your bedroom decor.",
        "detailTwo": "The wardrobe's sturdy construction ensures durability and longevity. Its timeless design blends seamlessly with traditional and farmhouse-inspired interiors. Whether used as a standalone piece or paired with matching furniture, this wardrobe enhances both functionality and style."
      }
    },
    {
      "id": "22",
      "name": "Mirrored Vanity Table",
      "category": "bedroom",
      "image": "https://img.freepik.com/free-photo/view-modern-entryway-with-interior-decor_23-2150791082.jpg?t=st=1719940617~exp=1719944217~hmac=a22f726a36991ac983436611a5d154d867292bf12b8a5d0d1210517d6c0abe04&w=740",
      "new_price": 600,
      "old_price": 800,
      "description": "A mirrored vanity table for glamorous bedroom settings.",
      "rating": 4.5,
      "reviews": 22,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        19,
        20,
        21
      ],
      "tags": [
        "mirrored",
        "vanity table",
        "glamorous"
      ],
      "details": {
        "detailOne": "Create a glamorous space with this mirrored vanity table. Its reflective surface adds brightness and sophistication to your bedroom decor. The spacious tabletop and drawers provide ample storage for cosmetics, jewelry, and beauty essentials.",
        "detailTwo": "Crafted from durable materials, the vanity table offers functionality and style. It's designed to complement various decor styles, from vintage-inspired to contemporary interiors. Whether used for daily grooming routines or as a decorative accent, this vanity table enhances your personal sanctuary."
      }
    },
    {
      "id": "23",
      "name": "Elegant Chandelier",
      "category": "decor",
      "image": "https://img.freepik.com/free-photo/peles-castle-interior-romania_1268-20814.jpg?t=st=1719940679~exp=1719944279~hmac=edd1ea9fdd1a56cb16e789e579b1246445be138e4e75ec8786d1a085ee8e1398&w=740",
      "new_price": 800,
      "old_price": 1000,
      "description": "An elegant chandelier for adding luxury to any room.",
      "rating": 4.6,
      "reviews": 28,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        24,
        25,
        26
      ],
      "tags": [
        "elegant",
        "chandelier",
        "luxury"
      ],
      "details": {
        "detailOne": "Illuminate your space with this elegant chandelier. Its crystal accents and polished finish exude luxury and sophistication. The adjustable chain allows you to customize the hanging length for optimal placement in any room.",
        "detailTwo": "The chandelier's multi-tiered design creates a stunning focal point, enhancing the ambiance of dining rooms, living areas, or entryways. It's designed to cast a warm and inviting glow, making it perfect for both everyday use and special occasions."
      }
    },
    {
      "id": "24",
      "name": "Vintage Wall Clock",
      "category": "decor",
      "image": "https://img.freepik.com/free-vector/vintage-clock-vector-illustration-remixed-from-artwork-by-florence-stevenson_53876-125466.jpg?t=st=1719940720~exp=1719944320~hmac=79e9487183d194ac6e3ba8f1caa4f25761f3f4d73d11739a2937243dab74e905&w=740",
      "new_price": 150,
      "old_price": 200,
      "description": "A vintage wall clock with timeless appeal.",
      "rating": 4.4,
      "reviews": 23,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        23,
        25,
        26
      ],
      "tags": [
        "vintage",
        "wall clock",
        "timeless"
      ],
      "details": {
        "detailOne": "Add charm to your walls with this vintage wall clock. Its classic design and antique finish create a nostalgic ambiance in any room. The large numbers and hands ensure easy visibility and accurate timekeeping.",
        "detailTwo": "Crafted from durable materials, the wall clock offers reliability and longevity. It's a decorative accent that also serves a functional purpose, enhancing the decor of kitchens, living rooms, or home offices. Whether used as a standalone piece or part of a gallery wall, this clock makes a timeless addition to your home."
      }
    },
    {
      "id": "25",
      "name": "Modern Floor Lamp",
      "category": "decor",
      "image": "https://img.freepik.com/free-photo/digital-art-style-light-lamp-design_23-2151153863.jpg?t=st=1719940756~exp=1719944356~hmac=00ce0b97c7e77939a9a49b47b70769b58cbe5fadc8b43f110266194c80343f7e&w=826",
      "new_price": 250,
      "old_price": 300,
      "description": "A modern floor lamp for contemporary living spaces.",
      "rating": 4.5,
      "reviews": 25,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        23,
        24,
        26
      ],
      "tags": [
        "modern",
        "floor lamp",
        "contemporary"
      ],
      "details": {
        "detailOne": "Illuminate your space with this modern floor lamp. Its sleek design and adjustable height make it ideal for reading nooks, living rooms, or home offices. The sturdy base ensures stability, while the fabric shade diffuses soft, ambient light.",
        "detailTwo": "The floor lamp's minimalist silhouette complements various decor styles, from mid-century modern to industrial interiors. It's easy to assemble and position, offering versatility and functionality. Enhance your home lighting with this stylish addition that combines form and function."
      }
    },
    {
      "id": "26",
      "name": "Art Deco Wall Mirror",
      "category": "decor",
      "image": "https://img.freepik.com/free-photo/ornate-mirror-art-nouveau-style_23-2150975623.jpg?t=st=1719940800~exp=1719944400~hmac=db036321b4a0ed213f7c54f3dae0dca59e1f0f5f664c10c14b759f14f986baf2&w=740",
      "new_price": 350,
      "old_price": 450,
      "description": "An art deco wall mirror for adding glamour to your walls.",
      "rating": 4.3,
      "reviews": 20,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        23,
        24,
        25
      ],
      "tags": [
        "art deco",
        "wall mirror",
        "glamour"
      ],
      "details": {
        "detailOne": "Make a statement with this art deco wall mirror. Its geometric frame and mirrored panels create a striking visual effect on any wall. The sleek design adds glamour and sophistication to modern and eclectic interiors alike.",
        "detailTwo": "Crafted from high-quality materials, the wall mirror offers durability and timeless appeal. It's a versatile piece that enhances the decor of entryways, living rooms, or bedrooms. Whether used as a focal point or in combination with other wall art, this mirror elevates your home decor."
      }
    },
    {
      "id": "27",
      "name": "Nordic Style Area Rug",
      "category": "decor",
      "image": "https://img.freepik.com/free-photo/pair-trendy-transparent-shoes-with-books-adhesive-note-coffee-mug-rug_23-2147840170.jpg?t=st=1719940846~exp=1719944446~hmac=cc5666a9f03cef8e373f7d06da7fd06b6d8ef1ae2a3361ab57de652e576fca23&w=740",
      "new_price": 300,
      "old_price": 400,
      "description": "A Nordic style area rug for cozy living spaces.",
      "rating": 4.2,
      "reviews": 18,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        28,
        29,
        30
      ],
      "tags": [
        "nordic style",
        "area rug",
        "cozy"
      ],
      "details": {
        "detailOne": "Enhance your living space with this Nordic style area rug. Its soft texture and geometric pattern create a cozy atmosphere in any room. The rug's neutral color palette complements various decor styles, from Scandinavian-inspired to minimalist interiors.",
        "detailTwo": "Crafted from premium materials, the area rug offers comfort and durability. It's easy to clean and maintain, making it suitable for high-traffic areas. Whether placed in a living room, bedroom, or dining area, this rug adds warmth and style to your home."
      }
    },
    {
      "id": "28",
      "name": "Bohemian Throw Pillow Set",
      "category": "decor",
      "image": "https://img.freepik.com/free-photo/exterior-outdoors-garden-chair-gardens_1203-4805.jpg?t=st=1719940918~exp=1719944518~hmac=a901b84e687304791b4a68a3f7360ddc79a731407a8a237d701ab2472d3ac8c9&w=740",
      "new_price": 80,
      "old_price": 100,
      "description": "A bohemian throw pillow set for eclectic home decor.",
      "rating": 4.4,
      "reviews": 22,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        27,
        29,
        30
      ],
      "tags": [
        "bohemian",
        "throw pillow set",
        "eclectic"
      ],
      "details": {
        "detailOne": "Add a pop of color and texture to your living space with this bohemian throw pillow set. Its vibrant patterns and tassel accents create an eclectic look that complements various decor styles. The pillows are crafted from soft fabrics for comfort and style.",
        "detailTwo": "The pillow covers feature hidden zippers for easy removal and cleaning. Mix and match different patterns to create a personalized arrangement on sofas, beds, or accent chairs. Enhance your home decor with this versatile set that combines comfort with bohemian flair."
      }
    },
    {
      "id": "29",
      "name": "Geometric Wall Art Set",
      "category": "decor",
      "image": "https://img.freepik.com/free-vector/abstract-watercolor-shapes-covers-collection_23-2148649030.jpg?t=st=1719940976~exp=1719944576~hmac=44bbb94f3fa1a6f1ebfbbd02f26b52a2112c29b74773ba0ecea2373b329dee4f&w=2000",
      "new_price": 120,
      "old_price": 150,
      "description": "A geometric wall art set for modern interiors.",
      "rating": 4.3,
      "reviews": 21,
      "topTrends": true,
      "newCollections": false,
      "relatedProducts": [
        27,
        28,
        30
      ],
      "tags": [
        "geometric",
        "wall art set",
        "modern"
      ],
      "details": {
        "detailOne": "Update your walls with this geometric wall art set. Its minimalist designs and monochromatic palette add a modern touch to any room. The artworks are framed for a polished look that enhances contemporary interiors.",
        "detailTwo": "Crafted from lightweight materials, the wall art set is easy to hang and arrange. Create a gallery wall or display individually in different rooms to complement your decor style. Whether used in living rooms, offices, or bedrooms, this set adds visual interest and sophistication."
      }
    },
    {
      "id": "30",
      "name": "Botanical Framed Prints",
      "category": "decor",
      "image": "https://img.freepik.com/free-vector/faded-foliage-banner_53876-91506.jpg?t=st=1719941010~exp=1719944610~hmac=b9a36202fe5b749c28b11c6f74e55a0b9b733fb9c42df6f4e1d1c5178a98b9b7&w=740",
      "new_price": 100,
      "old_price": 120,
      "description": "Botanical framed prints for natural-inspired decor.",
      "rating": 4.2,
      "reviews": 20,
      "topTrends": false,
      "newCollections": true,
      "relatedProducts": [
        27,
        28,
        29
      ],
      "tags": [
        "botanical",
        "framed prints",
        "natural"
      ],
      "details": {
        "detailOne": "Bring the beauty of nature indoors with these botanical framed prints. Featuring lush greenery and delicate florals, the artworks add a serene vibe to your living space. Each print is encased in a sleek frame for a polished presentation.",
        "detailTwo": "The framed prints are lightweight and easy to hang, allowing you to create a cohesive gallery wall or scatter them throughout your home. Whether displayed in a living room, kitchen, or hallway, they bring a touch of botanical charm to any room."
      }
    }
  ],
  "users": [
    {
      "id": "6e6a",
      "name": "Basil Pulikuth",
      "email": "iambasilp@gmail.com",
      "password": "sdfklsd2rwerr4r"
    },
    {
      "id": "d61b",
      "name": "Anas Panthappilakkal",
      "email": "anaspanthappilakal@gmail.com",
      "password": "ans pnaht pilakal @gmail.com"
    },
    {
      "id": "3080",
      "name": "Anas Panthappilakkal",
      "email": "anaspanthappilakal@gmail.com",
      "password": "ans pnaht pilakal @gmail.com"
    },
    {
      "id": "a4d4",
      "name": "Anas Panthappilakkal",
      "email": "anaspanthappilakal@gmail.com",
      "password": "ans pnaht pilakal @gmail.com"
    },
    {
      "id": "92cd",
      "name": "Abhijith Rahman",
      "email": "abhi@gmail.com",
      "password": "sre^3423&$!dfk"
    },
    {
      "id": "24c0",
      "name": "Mohammed Ayas Pulikuth",
      "email": "ayas124@gmail.com",
      "password": "sdfsdk$1323vddsf"
    },
    {
      "id": "5749",
      "name": "jhon",
      "email": "jhon@gmai.com",
      "password": "sdfsddfsdf"
    },
    {
      "id": "cca2",
      "name": "sdfsdfsd",
      "email": "sfsfa@gmail.com",
      "password": "sdlkfsd#243"
    },
    {
      "id": "21c8",
      "name": "jinu",
      "email": "jinu@gmail.com",
      "password": "jinuslfsdfsdf"
    },
    {
      "id": "bac9",
      "name": "Basil Pulikuth",
      "email": "iambasilp@gmail.com",
      "password": "b1a2s3?!il"
    },
    {
      "id": "7dba",
      "name": "ummukulso",
      "email": "iambausi",
      "password": "kldfkdlsf"
    },
    {
      "id": "c0e0",
      "name": "jnmnkl",
      "email": "jn,klj",
      "password": "kjl,m"
    },
    {
      "id": "679a",
      "name": "kkjkkljkl",
      "email": "jlkj",
      "password": "kjllkjl"
    },
    {
      "id": "339c",
      "name": "illjilkjililh",
      "email": "kjilkjkjl",
      "password": "lkjiokj"
    },
    {
      "id": "86f8",
      "name": "kjlkjk",
      "email": "ljljlkl",
      "password": "jljl"
    },
    {
      "id": "b52b",
      "name": "jkklkl",
      "email": "jkjkl",
      "password": "kljklj"
    },
    {
      "id": "4c4c",
      "name": "vxvxcvxc",
      "email": "vxcv",
      "password": "xcvxcv"
    },
    {
      "id": "5a63",
      "name": "dfsds",
      "email": "dfdss",
      "password": "dfs"
    },
    {
      "id": "c947",
      "name": "basil",
      "email": "basil",
      "password": "basil"
    },
    {
      "id": "81a8",
      "name": "surabhi",
      "email": "surabhi@gmail.com",
      "password": "surabhi"
    }
  ]
}